// *++
// 
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   CpStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell cp/copy command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"
#langdef   fra "Français"

#string STR_CP_MULT_DEST               #language eng  "%hs: Multiple destinations are not allowed\n"

#string STR_CP_CANNOT_OPEN_DEST        #language eng  "%hs: Cannot open destination - %hs\n"

#string STR_CP_CANNOT_OPEN             #language eng  "cp/copy: Cannot open %hs - %r\n"

#string STR_CP_SOURCE_NOT_FOUND        #language eng  "%hs: Source file not found\n"

#string STR_CP_MULT_SOURCE             #language eng  "%hs: When copy multiple sources, last argument should be a directory\n"

#string STR_CP_CANNOT_CREATE_DEST      #language eng  "%hs: Cannot create destination %hs\n"

#string STR_CP_DEST_READ_ONLY          #language eng  "%hs: Destination is read only or write protected\n"

#string STR_CP_CANNOT_OPEN_DIR         #language eng  "cp/copy: Cannot open current directory as destination - %r\n"

#string STR_CP_CANNOT_COPY_ITSELF      #language eng  "%hs: Cannot copy %hs to itself\n"

#string STR_CP_OUT_OF_MEM              #language eng  "%hs: Out of memory\n"

#string STR_CP_ACCESS_ERROR            #language eng  "%hs: Access %hs error\n"

#string STR_CP_OVERWRITE               #language eng  "Overwrite %s? (Yes/No/All/Cancel):"

#string STR_CP_COPYING                 #language eng  "copying %s -> %s\n"

#string STR_CP_SET_POS_ERROR           #language eng  "%hs: Set %hs pos error\n"

#string STR_CP_ZERO_LENGTH_ARG         #language eng  "cp/copy: Argument with zero length is not allowed\n"

#string STR_CP_ACCESS_ERROR_2          #language eng  "%hs: Access %hs error\n"

#string STR_CP_READ_ERROR              #language eng  "%hs: read error\n"

#string STR_CP_WRITE_ERROR             #language eng  "%hs: write error\n"                                           					

#string STR_CP_WRITE_ERROR_DISK_FULL   #language eng  "%hs: write error - disk full\n"

#string STR_CP_CANNOT_ACCESS           #language eng  "%hs: Cannot access '%hs'\n"

#string STR_CP_OK                      #language eng  " - [ok]\n"

#string STR_CP_CANNOT_OPEN_CREATE      #language eng  "%hs: Cannot open/create %hs under %hs\n"

#string STR_CP_CANNOT_COPY_FROM        #language eng  "%hs: Cannot copy from %hs to %hs\n"

#string STR_CP_CANNOT_COPY_SUBDIR      #language eng  "%hs: Cannot copy directory %hs to its subdirectory\n"

#string STR_CP_CANNOT_DIR_WITHOUT_R    #language eng  "%hs: Cannot copy directory or subdirectory %hs without '-r'\n"

#string STR_CP_READ_ERROR_2            #language eng  "%hs: Read %hs error\n"

#string STR_CP_MAKING_DIR              #language eng  "Making dir %hs\n"

#string STR_CP_CANNOT_OPEN_CREATE_2    #language eng  "%hs: Cannot open/create %hs under %hs\n"

#string STR_CP_CANNOT_OVERWIRTE_FILE_WITH_DIR    #language eng  "%hs: Cannot overwrite file %hs with directory\n"

#string STR_CP_CANNOT_OVERWIRTE_DIR_WITH_FILE    #language eng  "%hs: Cannot overwrite dir %hs with file\n"

#string STR_CP_LINE_HELP               #language eng  "Copies one or more files/directories to another location"

#string STR_CP_VERBOSE_HELP            #language eng  "Copies one or more files/directories to another location.\n"
                                                      "\n"
                                                      "CP [-r] [-q] src [src...] [dst]\n"
                                                      "\n"
                                                      "     -r      - Recursive copy\n"
                                                      "     -q      - Quiet copying (replace existing files without prompt)\n"
                                                      "     src     - Source file/directory name (wildcards are permitted)\n"
                                                      "     dst     - Destination file/directory name (wildcards are not permitted)\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. '-r' must be specified if src is a directory. If '-r' is specified, \n"
                                                      "       then the source directory will be recursively copied to the destination.\n"
                                                      "       Src itself will be copied.\n"
                                                      "    2. If 'dst' parameter is not specified, then the current directory is \n"
                                                      "       assumed to be the destination.\n"
                                                      "    3. 'CP -r src1 src2 dst' is to copy all files and subdirectories in 'src1'\n"
                                                      "       and 'src2' to the destination 'dst'. 'Src1' and 'src2' themselves are \n"
                                                      "       also copied.'dst' parameter will be interpreted as a directory.\n"
                                                      "    4. Copying a directory/file to itself is not allowed.\n"
                                                      "    5. If an error occurs, CP will exit immediately and the remaining files\n"
                                                      "       or directories will not be copied.\n"
                                                      "    6. When 'cp' is executed with a script file, it always performs quiet\n"
                                                      "       copying regardless of whether the '-q' option is specified.\n"
                                                      "    7. If you are copying multiple files, the destination must be an existing\n"
                                                      "       directory.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the contents of current directory first of all:\n"
                                                      "    fs0:\\> ls\n"
                                                      "    Directory of: fs0:\\ \n"
                                                      "\n"
                                                      "      06/18/01  01:02p <DIR>            512  efi\n"
                                                      "      06/18/01  01:02p <DIR>            512  test1\n"
                                                      "      06/18/01  01:02p <DIR>            512  test2\n"
                                                      "      06/13/01  10:00a               28,739  IsaBus.efi\n"
                                                      "      06/13/01  10:00a               32,838  IsaSerial.efi\n"
                                                      "      06/18/01  08:04p                   29  temp.txt\n"
                                                      "      06/18/01  08:05p <DIR>            512  test\n"
                                                      "              3 File(s)      61,606 bytes\n"
                                                      "              4 Dir(s)\n"
                                                      "\n"
                                                      "  * To copy a file in the same directory but change the file name:\n"
                                                      "    fs0:\\> cp temp.txt readme.txt\n"
                                                      "    copying fs0:\\temp.txt -> fs0:\\readme.txt\n"
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To copy multiple files to another directory:\n"     
                                                      "    fs0:\\> cp temp.txt isaBus.efi \\test\n"
                                                      "    copying fs0:\\temp.txt -> fs0:\\test\\temp.txt\n"
                                                      "     - [ok]\n"
                                                      "    copying fs0:\\isaBus.efi -> fs0:\\test\\IsaBus.efi\n"
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To copy multiple directories recursively to another directory:\n"
                                                      "    fs0:\\> cp -r test1 test2 boot \\test\n"
                                                      "    copying fs0:\\test1 -> fs0:\\test\\test1\n"                                                      
                                                      "    copying fs0:\\test1\\test1.txt -> fs0:\\test\\test1\\test1.txt\n"
                                                      "     - [ok]\n"
                                                      "    copying fs0:\\test2 -> fs0:\\test\\test2\n"                                                      
                                                      "    copying fs0:\\test2\\test2.txt -> fs0:\\test\\test2\\test2.txt\n"
                                                      "     - [ok]\n"
                                                      "    copying fs0:\\boot -> fs0:\\test\\boot\n"           
                                                      "    copying fs0:\\boot\\shell.efi -> fs0:\\test\\boot\\shell.efi\n"                                                      
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To see the results of above operations:\n"
                                                      "    fs0:\\> ls \\test\n"
                                                      "    Directory of: fs0:\\test\n"
                                                      "\n"
                                                      "      06/18/01  01:01p <DIR>            512  .\n"
                                                      "      06/18/01  01:01p <DIR>              0  ..\n"
                                                      "      01/28/01  08:21p <DIR>            512  test1\n"
                                                      "      01/28/01  08:21p <DIR>            512  test2\n"
                                                      "      01/28/01  08:21p <DIR>            512  boot\n"
                                                      "      01/28/01  08:23p                   29  temp.txt\n"
                                                      "      01/28/01  08:23p               28,739  IsaBus.efi\n"
                                                      "              2 File(s)      28,828 bytes\n"
                                                      "              5 Dir(s)\n"

#string STR_COPY_LINE_HELP             #language eng  "Copies one or more files/directories to another location"

#string STR_COPY_VERBOSE_HELP          #language eng  "Copies one or more files/directories to another location.\n"
                                                      "\n"
                                                      "COPY [-r] [-q] src [src...] [dst]\n"
                                                      "\n"
                                                      "     -r      - Recursive copy\n"
                                                      "     -q      - Quiet copying (replace existing files without prompt)\n"
                                                      "     src     - Source file/directory name (wildcards are permitted)\n"
                                                      "     dst     - Destination file/directory name (wildcards are not permitted)\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. '-r' must be specified if src is a directory. If '-r' is specified, \n"
                                                      "       then the source directory will be recursively copied to the destination.\n"
                                                      "       Src itself will be copied.\n"
                                                      "    2. If 'dst' parameter is not specified, then the current directory is assumed to be\n"
                                                      "       the destination.\n"
                                                      "    3. 'COPY -r src1 src2 dst' is to copy all files and subdirectories in\n"
                                                      "       'src1' and 'src2' to the 'dst.' 'Src1' and 'src2' themselves are also\n"
                                                      "       copied. 'dst' parameter will be interpreted as a directory.\n"
                                                      "    4. Copying a directory/file to itself is not allowed.\n"
                                                      "    5. If an error occurs, COPY will exit immediately and the remaining files\n"
                                                      "       or directories will not be copied.\n"
                                                      "    6. When 'copy' is executed with a script file, it always performs quiet\n"
                                                      "       copying regardless of whether the '-q' option is specified.\n"
                                                      "    7. If you are copying multiple files, the destination must be an existing\n"
                                                      "       directory.\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display the contents of current directory first of all:\n"
                                                      "    fs0:\\> ls\n"
                                                      "    Directory of: fs0:\\ \n"
                                                      "\n"
                                                      "      06/18/01  01:02p <DIR>            512  efi\n"
                                                      "      06/18/01  01:02p <DIR>            512  test1\n"
                                                      "      06/18/01  01:02p <DIR>            512  test2\n"
                                                      "      06/13/01  10:00a               28,739  IsaBus.efi\n"
                                                      "      06/13/01  10:00a               32,838  IsaSerial.efi\n"
                                                      "      06/18/01  08:04p                   29  temp.txt\n"
                                                      "      06/18/01  08:05p <DIR>            512  test\n"
                                                      "              3 File(s)      61,606 bytes\n"
                                                      "              4 Dir(s)\n"
                                                      "\n"
                                                      "  * To copy a file in the same directory but change the file name:\n"
                                                      "    fs0:\\> copy temp.txt readme.txt\n"
                                                      "    copying fs0:\\temp.txt -> fs0:\\readme.txt\n"
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To copy multiple files to another directory:\n"     
                                                      "    fs0:\\> copy temp.txt isaBus.efi \\test\n"
                                                      "    copying fs0:\\temp.txt -> fs0:\\test\\temp.txt\n"
                                                      "     - [ok]\n"
                                                      "    copying fs0:\\isaBus.efi -> fs0:\\test\\IsaBus.efi\n"
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To copy multiple directories recursively to another directory:\n"
                                                      "    fs0:\\> copy -r test1 test2 boot \\test\n"
                                                      "    copying fs0:\\test1 -> fs0:\\test\\test1\n"                                                      
                                                      "    copying fs0:\\test1\\test1.txt -> fs0:\\test\\test1\\test1.txt\n"
                                                      "     - [ok]\n"
                                                      "    copying fs0:\\test2 -> fs0:\\test\\test2\n"                                                      
                                                      "    copying fs0:\\test2\\test2.txt -> fs0:\\test\\test2\\test2.txt\n"
                                                      "     - [ok]\n"
                                                      "    copying fs0:\\boot -> fs0:\\test\\boot\n"                                                                                                            
                                                      "    copying fs0:\\boot\\shell.efi -> fs0:\\test\\boot\\shell.efi\n"                                                      
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To see the results of the above operations:\n"
                                                      "    fs0:\\> ls \\test\n"
                                                      "    Directory of: fs0:\\test\n"
                                                      "\n"
                                                      "      06/18/01  01:01p <DIR>            512  .\n"
                                                      "      06/18/01  01:01p <DIR>              0  ..\n"
                                                      "      01/28/01  08:21p                   30  test1.txt\n"
                                                      "      01/28/01  08:21p                   30  test2.txt\n"
                                                      "      01/28/01  08:21p <DIR>            512  boot\n"
                                                      "      01/28/01  08:23p                   29  temp.txt\n"
                                                      "      01/28/01  08:23p               28,739  IsaBus.efi\n"
                                                      "              4 File(s)      28,828 bytes\n"
                                                      "              3 Dir(s)\n"









